danielRep/mcu-tpa-eval/src/app/cy8cproto063/core1/inc/cyble_416045_02_device.h
#define PERI_BASE                               0x40010000UL
#define PERI_PPU_GR_MMIO0_BASE                  0x40015000UL
#define PERI_PPU_GR_MMIO1_BASE                  0x40015040UL
#define PERI_PPU_GR_MMIO2_BASE                  0x40015080UL
#define PERI_PPU_GR_MMIO3_BASE                  0x400150C0UL
#define PERI_PPU_GR_MMIO4_BASE                  0x40015100UL
#define PERI_PPU_GR_MMIO6_BASE                  0x40015180UL
#define PERI_PPU_GR_MMIO9_BASE                  0x40015240UL
#define PERI_PPU_GR_MMIO10_BASE                 0x40015280UL
#define PERI_GR_PPU_SL_PERI_GR1_BASE            0x40100000UL
#define PERI_GR_PPU_SL_CRYPTO_BASE              0x40100040UL
#define PERI_GR_PPU_SL_PERI_GR2_BASE            0x40200000UL
#define PERI_GR_PPU_SL_CPUSS_BASE               0x40200040UL
#define PERI_GR_PPU_SL_FAULT_BASE               0x40200080UL
#define PERI_GR_PPU_SL_IPC_BASE                 0x402000C0UL
#define PERI_GR_PPU_SL_PROT_BASE                0x40200100UL
#define PERI_GR_PPU_SL_FLASHC_BASE              0x40200140UL
#define PERI_GR_PPU_SL_SRSS_BASE                0x40200180UL
#define PERI_GR_PPU_SL_BACKUP_BASE              0x402001C0UL
#define PERI_GR_PPU_SL_DW0_BASE                 0x40200200UL
#define PERI_GR_PPU_SL_DW1_BASE                 0x40200240UL
#define PERI_GR_PPU_SL_EFUSE_BASE               0x40200300UL
#define PERI_GR_PPU_SL_PROFILE_BASE             0x40200340UL
#define PERI_GR_PPU_RG_IPC_STRUCT0_BASE         0x40201000UL
#define PERI_GR_PPU_RG_IPC_STRUCT1_BASE         0x40201040UL
#define PERI_GR_PPU_RG_IPC_STRUCT2_BASE         0x40201080UL
#define PERI_GR_PPU_RG_IPC_STRUCT3_BASE         0x402010C0UL
#define PERI_GR_PPU_RG_IPC_STRUCT4_BASE         0x40201100UL
#define PERI_GR_PPU_RG_IPC_STRUCT5_BASE         0x40201140UL
#define PERI_GR_PPU_RG_IPC_STRUCT6_BASE         0x40201180UL
#define PERI_GR_PPU_RG_IPC_STRUCT7_BASE         0x402011C0UL
#define PERI_GR_PPU_RG_IPC_INTR_STRUCT0_BASE    0x40201200UL
#define PERI_GR_PPU_RG_IPC_INTR_STRUCT1_BASE    0x40201240UL
#define PERI_GR_PPU_RG_IPC_INTR_STRUCT2_BASE    0x40201280UL
#define PERI_GR_PPU_RG_IPC_INTR_STRUCT3_BASE    0x402012C0UL
#define PERI_GR_PPU_RG_IPC_INTR_STRUCT4_BASE    0x40201300UL
#define PERI_GR_PPU_RG_IPC_INTR_STRUCT5_BASE    0x40201340UL
#define PERI_GR_PPU_RG_IPC_INTR_STRUCT6_BASE    0x40201380UL
#define PERI_GR_PPU_RG_IPC_INTR_STRUCT7_BASE    0x402013C0UL
#define PERI_GR_PPU_RG_DW0_DW_CH_STRUCT0_BASE   0x40201400UL
#define PERI_GR_PPU_RG_DW0_DW_CH_STRUCT1_BASE   0x40201440UL
#define PERI_GR_PPU_RG_DW0_DW_CH_STRUCT2_BASE   0x40201480UL
#define PERI_GR_PPU_RG_DW0_DW_CH_STRUCT3_BASE   0x402014C0UL
#define PERI_GR_PPU_RG_DW1_DW_CH_STRUCT0_BASE   0x40201500UL
#define PERI_GR_PPU_RG_DW1_DW_CH_STRUCT1_BASE   0x40201540UL
#define PERI_GR_PPU_RG_DW1_DW_CH_STRUCT2_BASE   0x40201580UL
#define PERI_GR_PPU_RG_DW1_DW_CH_STRUCT3_BASE   0x402015C0UL
#define PERI_GR_PPU_RG_SMPU_BASE                0x40201600UL
#define PERI_GR_PPU_RG_MPU_CM0P_BASE            0x40201640UL
#define PERI_GR_PPU_RG_MPU_CRYPTO_BASE          0x40201680UL
#define PERI_GR_PPU_RG_MPU_CM4_BASE             0x402016C0UL
#define PERI_GR_PPU_RG_MPU_TC_BASE              0x40201700UL
#define PERI_GR_PPU_SL_PERI_GR3_BASE            0x40300000UL
#define PERI_GR_PPU_SL_HSIOM_BASE               0x40300040UL
#define PERI_GR_PPU_SL_GPIO_BASE                0x40300080UL
#define PERI_GR_PPU_SL_SMARTIO_BASE             0x403000C0UL
#define PERI_GR_PPU_SL_UDB_BASE                 0x40300100UL
#define PERI_GR_PPU_SL_LPCOMP_BASE              0x40300140UL
#define PERI_GR_PPU_SL_CSD_BASE                 0x40300180UL
#define PERI_GR_PPU_SL_TCPWM0_BASE              0x40300200UL
#define PERI_GR_PPU_SL_TCPWM1_BASE              0x40300240UL
#define PERI_GR_PPU_SL_LCD_BASE                 0x40300280UL
#define PERI_GR_PPU_SL_BLE_BASE                 0x403002C0UL
#define PERI_GR_PPU_SL_USBFS_BASE               0x40300300UL
#define PERI_GR_PPU_SL_PERI_GR4_BASE            0x40400000UL
#define PERI_GR_PPU_SL_SMIF_BASE                0x40400080UL
#define PERI_GR_PPU_SL_PERI_GR6_BASE            0x40600000UL
#define PERI_GR_PPU_SL_SCB0_BASE                0x40600040UL
#define PERI_GR_PPU_SL_SCB1_BASE                0x40600080UL
#define PERI_GR_PPU_SL_SCB2_BASE                0x406000C0UL
#define PERI_GR_PPU_SL_SCB3_BASE                0x40600100UL
#define PERI_GR_PPU_SL_SCB4_BASE                0x40600140UL
#define PERI_GR_PPU_SL_SCB5_BASE                0x40600180UL
#define PERI_GR_PPU_SL_SCB6_BASE                0x406001C0UL
#define PERI_GR_PPU_SL_SCB7_BASE                0x40600200UL
#define PERI_GR_PPU_SL_SCB8_BASE                0x40600240UL
#define PERI_GR_PPU_SL_PERI_GR9_BASE            0x41000000UL
#define PERI_GR_PPU_SL_PASS_BASE                0x41000040UL
#define PERI_GR_PPU_SL_PERI_GR10_BASE           0x42A00000UL
#define PERI_GR_PPU_SL_I2S_BASE                 0x42A00040UL
#define PERI_GR_PPU_SL_PDM_BASE                 0x42A00080UL
#define PERI                                    ((PERI_Type*) PERI_BASE)                                          /* 0x40010000 */
#define PERI_GR0                                ((PERI_GR_Type*) &PERI->GR[0])                                    /* 0x40010000 */
#define PERI_GR1                                ((PERI_GR_Type*) &PERI->GR[1])                                    /* 0x40010040 */
#define PERI_GR2                                ((PERI_GR_Type*) &PERI->GR[2])                                    /* 0x40010080 */
#define PERI_GR3                                ((PERI_GR_Type*) &PERI->GR[3])                                    /* 0x400100C0 */
#define PERI_GR4                                ((PERI_GR_Type*) &PERI->GR[4])                                    /* 0x40010100 */
#define PERI_GR6                                ((PERI_GR_Type*) &PERI->GR[6])                                    /* 0x40010180 */
#define PERI_GR9                                ((PERI_GR_Type*) &PERI->GR[9])                                    /* 0x40010240 */
#define PERI_GR10                               ((PERI_GR_Type*) &PERI->GR[10])                                   /* 0x40010280 */
#define PERI_TR_GR0                             ((PERI_TR_GR_Type*) &PERI->TR_GR[0])                              /* 0x40012000 */
#define PERI_TR_GR1                             ((PERI_TR_GR_Type*) &PERI->TR_GR[1])                              /* 0x40012200 */
#define PERI_TR_GR2                             ((PERI_TR_GR_Type*) &PERI->TR_GR[2])                              /* 0x40012400 */
#define PERI_TR_GR3                             ((PERI_TR_GR_Type*) &PERI->TR_GR[3])                              /* 0x40012600 */
#define PERI_TR_GR4                             ((PERI_TR_GR_Type*) &PERI->TR_GR[4])                              /* 0x40012800 */
#define PERI_TR_GR5                             ((PERI_TR_GR_Type*) &PERI->TR_GR[5])                              /* 0x40012A00 */
#define PERI_TR_GR6                             ((PERI_TR_GR_Type*) &PERI->TR_GR[6])                              /* 0x40012C00 */
#define PERI_TR_GR7                             ((PERI_TR_GR_Type*) &PERI->TR_GR[7])                              /* 0x40012E00 */
#define PERI_TR_GR8                             ((PERI_TR_GR_Type*) &PERI->TR_GR[8])                              /* 0x40013000 */
#define PERI_TR_GR9                             ((PERI_TR_GR_Type*) &PERI->TR_GR[9])                              /* 0x40013200 */
#define PERI_TR_GR10                            ((PERI_TR_GR_Type*) &PERI->TR_GR[10])                             /* 0x40013400 */
#define PERI_TR_GR11                            ((PERI_TR_GR_Type*) &PERI->TR_GR[11])                             /* 0x40013600 */
#define PERI_TR_GR12                            ((PERI_TR_GR_Type*) &PERI->TR_GR[12])                             /* 0x40013800 */
#define PERI_TR_GR13                            ((PERI_TR_GR_Type*) &PERI->TR_GR[13])                             /* 0x40013A00 */
#define PERI_TR_GR14                            ((PERI_TR_GR_Type*) &PERI->TR_GR[14])                             /* 0x40013C00 */
#define PERI_PPU_PR0                            ((PERI_PPU_PR_Type*) &PERI->PPU_PR[0])                            /* 0x40014000 */
#define PERI_PPU_PR1                            ((PERI_PPU_PR_Type*) &PERI->PPU_PR[1])                            /* 0x40014040 */
#define PERI_PPU_PR2                            ((PERI_PPU_PR_Type*) &PERI->PPU_PR[2])                            /* 0x40014080 */
#define PERI_PPU_PR3                            ((PERI_PPU_PR_Type*) &PERI->PPU_PR[3])                            /* 0x400140C0 */
#define PERI_PPU_PR4                            ((PERI_PPU_PR_Type*) &PERI->PPU_PR[4])                            /* 0x40014100 */
#define PERI_PPU_PR5                            ((PERI_PPU_PR_Type*) &PERI->PPU_PR[5])                            /* 0x40014140 */
#define PERI_PPU_PR6                            ((PERI_PPU_PR_Type*) &PERI->PPU_PR[6])                            /* 0x40014180 */
#define PERI_PPU_PR7                            ((PERI_PPU_PR_Type*) &PERI->PPU_PR[7])                            /* 0x400141C0 */
#define PERI_PPU_PR8                            ((PERI_PPU_PR_Type*) &PERI->PPU_PR[8])                            /* 0x40014200 */
#define PERI_PPU_PR9                            ((PERI_PPU_PR_Type*) &PERI->PPU_PR[9])                            /* 0x40014240 */
#define PERI_PPU_PR10                           ((PERI_PPU_PR_Type*) &PERI->PPU_PR[10])                           /* 0x40014280 */
#define PERI_PPU_PR11                           ((PERI_PPU_PR_Type*) &PERI->PPU_PR[11])                           /* 0x400142C0 */
#define PERI_PPU_PR12                           ((PERI_PPU_PR_Type*) &PERI->PPU_PR[12])                           /* 0x40014300 */
#define PERI_PPU_PR13                           ((PERI_PPU_PR_Type*) &PERI->PPU_PR[13])                           /* 0x40014340 */
#define PERI_PPU_PR14                           ((PERI_PPU_PR_Type*) &PERI->PPU_PR[14])                           /* 0x40014380 */
#define PERI_PPU_PR15                           ((PERI_PPU_PR_Type*) &PERI->PPU_PR[15])                           /* 0x400143C0 */
#define PERI_PPU_GR0                            ((PERI_PPU_GR_Type*) &PERI->PPU_GR[0])                            /* 0x40015000 */
#define PERI_PPU_GR1                            ((PERI_PPU_GR_Type*) &PERI->PPU_GR[1])                            /* 0x40015040 */
#define PERI_PPU_GR2                            ((PERI_PPU_GR_Type*) &PERI->PPU_GR[2])                            /* 0x40015080 */
#define PERI_PPU_GR3                            ((PERI_PPU_GR_Type*) &PERI->PPU_GR[3])                            /* 0x400150C0 */
#define PERI_PPU_GR4                            ((PERI_PPU_GR_Type*) &PERI->PPU_GR[4])                            /* 0x40015100 */
#define PERI_PPU_GR6                            ((PERI_PPU_GR_Type*) &PERI->PPU_GR[6])                            /* 0x40015180 */
#define PERI_PPU_GR9                            ((PERI_PPU_GR_Type*) &PERI->PPU_GR[9])                            /* 0x40015240 */
#define PERI_PPU_GR10                           ((PERI_PPU_GR_Type*) &PERI->PPU_GR[10])                           /* 0x40015280 */
#define PERI_PPU_GR_MMIO0                       ((PERI_PPU_GR_Type*) PERI_PPU_GR_MMIO0_BASE)                      /* 0x40015000 */
#define PERI_PPU_GR_MMIO1                       ((PERI_PPU_GR_Type*) PERI_PPU_GR_MMIO1_BASE)                      /* 0x40015040 */
#define PERI_PPU_GR_MMIO2                       ((PERI_PPU_GR_Type*) PERI_PPU_GR_MMIO2_BASE)                      /* 0x40015080 */
#define PERI_PPU_GR_MMIO3                       ((PERI_PPU_GR_Type*) PERI_PPU_GR_MMIO3_BASE)                      /* 0x400150C0 */
#define PERI_PPU_GR_MMIO4                       ((PERI_PPU_GR_Type*) PERI_PPU_GR_MMIO4_BASE)                      /* 0x40015100 */
#define PERI_PPU_GR_MMIO6                       ((PERI_PPU_GR_Type*) PERI_PPU_GR_MMIO6_BASE)                      /* 0x40015180 */
#define PERI_PPU_GR_MMIO9                       ((PERI_PPU_GR_Type*) PERI_PPU_GR_MMIO9_BASE)                      /* 0x40015240 */
#define PERI_PPU_GR_MMIO10                      ((PERI_PPU_GR_Type*) PERI_PPU_GR_MMIO10_BASE)                     /* 0x40015280 */
#define PERI_GR_PPU_SL_PERI_GR1                 ((PERI_GR_PPU_SL_Type*) PERI_GR_PPU_SL_PERI_GR1_BASE)             /* 0x40100000 */
#define PERI_GR_PPU_SL_CRYPTO                   ((PERI_GR_PPU_SL_Type*) PERI_GR_PPU_SL_CRYPTO_BASE)               /* 0x40100040 */
#define PERI_GR_PPU_SL_PERI_GR2                 ((PERI_GR_PPU_SL_Type*) PERI_GR_PPU_SL_PERI_GR2_BASE)             /* 0x40200000 */
#define PERI_GR_PPU_SL_CPUSS                    ((PERI_GR_PPU_SL_Type*) PERI_GR_PPU_SL_CPUSS_BASE)                /* 0x40200040 */
#define PERI_GR_PPU_SL_FAULT                    ((PERI_GR_PPU_SL_Type*) PERI_GR_PPU_SL_FAULT_BASE)                /* 0x40200080 */
#define PERI_GR_PPU_SL_IPC                      ((PERI_GR_PPU_SL_Type*) PERI_GR_PPU_SL_IPC_BASE)                  /* 0x402000C0 */
#define PERI_GR_PPU_SL_PROT                     ((PERI_GR_PPU_SL_Type*) PERI_GR_PPU_SL_PROT_BASE)                 /* 0x40200100 */
#define PERI_GR_PPU_SL_FLASHC                   ((PERI_GR_PPU_SL_Type*) PERI_GR_PPU_SL_FLASHC_BASE)               /* 0x40200140 */
#define PERI_GR_PPU_SL_SRSS                     ((PERI_GR_PPU_SL_Type*) PERI_GR_PPU_SL_SRSS_BASE)                 /* 0x40200180 */
#define PERI_GR_PPU_SL_BACKUP                   ((PERI_GR_PPU_SL_Type*) PERI_GR_PPU_SL_BACKUP_BASE)               /* 0x402001C0 */
#define PERI_GR_PPU_SL_DW0                      ((PERI_GR_PPU_SL_Type*) PERI_GR_PPU_SL_DW0_BASE)                  /* 0x40200200 */
#define PERI_GR_PPU_SL_DW1                      ((PERI_GR_PPU_SL_Type*) PERI_GR_PPU_SL_DW1_BASE)                  /* 0x40200240 */
#define PERI_GR_PPU_SL_EFUSE                    ((PERI_GR_PPU_SL_Type*) PERI_GR_PPU_SL_EFUSE_BASE)                /* 0x40200300 */
#define PERI_GR_PPU_SL_PROFILE                  ((PERI_GR_PPU_SL_Type*) PERI_GR_PPU_SL_PROFILE_BASE)              /* 0x40200340 */
#define PERI_GR_PPU_RG_IPC_STRUCT0              ((PERI_GR_PPU_RG_Type*) PERI_GR_PPU_RG_IPC_STRUCT0_BASE)          /* 0x40201000 */
#define PERI_GR_PPU_RG_IPC_STRUCT1              ((PERI_GR_PPU_RG_Type*) PERI_GR_PPU_RG_IPC_STRUCT1_BASE)          /* 0x40201040 */
#define PERI_GR_PPU_RG_IPC_STRUCT2              ((PERI_GR_PPU_RG_Type*) PERI_GR_PPU_RG_IPC_STRUCT2_BASE)          /* 0x40201080 */
#define PERI_GR_PPU_RG_IPC_STRUCT3              ((PERI_GR_PPU_RG_Type*) PERI_GR_PPU_RG_IPC_STRUCT3_BASE)          /* 0x402010C0 */
#define PERI_GR_PPU_RG_IPC_STRUCT4              ((PERI_GR_PPU_RG_Type*) PERI_GR_PPU_RG_IPC_STRUCT4_BASE)          /* 0x40201100 */
#define PERI_GR_PPU_RG_IPC_STRUCT5              ((PERI_GR_PPU_RG_Type*) PERI_GR_PPU_RG_IPC_STRUCT5_BASE)          /* 0x40201140 */
#define PERI_GR_PPU_RG_IPC_STRUCT6              ((PERI_GR_PPU_RG_Type*) PERI_GR_PPU_RG_IPC_STRUCT6_BASE)          /* 0x40201180 */
#define PERI_GR_PPU_RG_IPC_STRUCT7              ((PERI_GR_PPU_RG_Type*) PERI_GR_PPU_RG_IPC_STRUCT7_BASE)          /* 0x402011C0 */
#define PERI_GR_PPU_RG_IPC_INTR_STRUCT0         ((PERI_GR_PPU_RG_Type*) PERI_GR_PPU_RG_IPC_INTR_STRUCT0_BASE)     /* 0x40201200 */
#define PERI_GR_PPU_RG_IPC_INTR_STRUCT1         ((PERI_GR_PPU_RG_Type*) PERI_GR_PPU_RG_IPC_INTR_STRUCT1_BASE)     /* 0x40201240 */
#define PERI_GR_PPU_RG_IPC_INTR_STRUCT2         ((PERI_GR_PPU_RG_Type*) PERI_GR_PPU_RG_IPC_INTR_STRUCT2_BASE)     /* 0x40201280 */
#define PERI_GR_PPU_RG_IPC_INTR_STRUCT3         ((PERI_GR_PPU_RG_Type*) PERI_GR_PPU_RG_IPC_INTR_STRUCT3_BASE)     /* 0x402012C0 */
#define PERI_GR_PPU_RG_IPC_INTR_STRUCT4         ((PERI_GR_PPU_RG_Type*) PERI_GR_PPU_RG_IPC_INTR_STRUCT4_BASE)     /* 0x40201300 */
#define PERI_GR_PPU_RG_IPC_INTR_STRUCT5         ((PERI_GR_PPU_RG_Type*) PERI_GR_PPU_RG_IPC_INTR_STRUCT5_BASE)     /* 0x40201340 */
#define PERI_GR_PPU_RG_IPC_INTR_STRUCT6         ((PERI_GR_PPU_RG_Type*) PERI_GR_PPU_RG_IPC_INTR_STRUCT6_BASE)     /* 0x40201380 */
#define PERI_GR_PPU_RG_IPC_INTR_STRUCT7         ((PERI_GR_PPU_RG_Type*) PERI_GR_PPU_RG_IPC_INTR_STRUCT7_BASE)     /* 0x402013C0 */
#define PERI_GR_PPU_RG_DW0_DW_CH_STRUCT0        ((PERI_GR_PPU_RG_Type*) PERI_GR_PPU_RG_DW0_DW_CH_STRUCT0_BASE)    /* 0x40201400 */
#define PERI_GR_PPU_RG_DW0_DW_CH_STRUCT1        ((PERI_GR_PPU_RG_Type*) PERI_GR_PPU_RG_DW0_DW_CH_STRUCT1_BASE)    /* 0x40201440 */
#define PERI_GR_PPU_RG_DW0_DW_CH_STRUCT2        ((PERI_GR_PPU_RG_Type*) PERI_GR_PPU_RG_DW0_DW_CH_STRUCT2_BASE)    /* 0x40201480 */
#define PERI_GR_PPU_RG_DW0_DW_CH_STRUCT3        ((PERI_GR_PPU_RG_Type*) PERI_GR_PPU_RG_DW0_DW_CH_STRUCT3_BASE)    /* 0x402014C0 */
#define PERI_GR_PPU_RG_DW1_DW_CH_STRUCT0        ((PERI_GR_PPU_RG_Type*) PERI_GR_PPU_RG_DW1_DW_CH_STRUCT0_BASE)    /* 0x40201500 */
#define PERI_GR_PPU_RG_DW1_DW_CH_STRUCT1        ((PERI_GR_PPU_RG_Type*) PERI_GR_PPU_RG_DW1_DW_CH_STRUCT1_BASE)    /* 0x40201540 */
#define PERI_GR_PPU_RG_DW1_DW_CH_STRUCT2        ((PERI_GR_PPU_RG_Type*) PERI_GR_PPU_RG_DW1_DW_CH_STRUCT2_BASE)    /* 0x40201580 */
#define PERI_GR_PPU_RG_DW1_DW_CH_STRUCT3        ((PERI_GR_PPU_RG_Type*) PERI_GR_PPU_RG_DW1_DW_CH_STRUCT3_BASE)    /* 0x402015C0 */
#define PERI_GR_PPU_RG_SMPU                     ((PERI_GR_PPU_RG_Type*) PERI_GR_PPU_RG_SMPU_BASE)                 /* 0x40201600 */
#define PERI_GR_PPU_RG_MPU_CM0P                 ((PERI_GR_PPU_RG_Type*) PERI_GR_PPU_RG_MPU_CM0P_BASE)             /* 0x40201640 */
#define PERI_GR_PPU_RG_MPU_CRYPTO               ((PERI_GR_PPU_RG_Type*) PERI_GR_PPU_RG_MPU_CRYPTO_BASE)           /* 0x40201680 */
#define PERI_GR_PPU_RG_MPU_CM4                  ((PERI_GR_PPU_RG_Type*) PERI_GR_PPU_RG_MPU_CM4_BASE)              /* 0x402016C0 */
#define PERI_GR_PPU_RG_MPU_TC                   ((PERI_GR_PPU_RG_Type*) PERI_GR_PPU_RG_MPU_TC_BASE)               /* 0x40201700 */
#define PERI_GR_PPU_SL_PERI_GR3                 ((PERI_GR_PPU_SL_Type*) PERI_GR_PPU_SL_PERI_GR3_BASE)             /* 0x40300000 */
#define PERI_GR_PPU_SL_HSIOM                    ((PERI_GR_PPU_SL_Type*) PERI_GR_PPU_SL_HSIOM_BASE)                /* 0x40300040 */
#define PERI_GR_PPU_SL_GPIO                     ((PERI_GR_PPU_SL_Type*) PERI_GR_PPU_SL_GPIO_BASE)                 /* 0x40300080 */
#define PERI_GR_PPU_SL_SMARTIO                  ((PERI_GR_PPU_SL_Type*) PERI_GR_PPU_SL_SMARTIO_BASE)              /* 0x403000C0 */
#define PERI_GR_PPU_SL_UDB                      ((PERI_GR_PPU_SL_Type*) PERI_GR_PPU_SL_UDB_BASE)                  /* 0x40300100 */
#define PERI_GR_PPU_SL_LPCOMP                   ((PERI_GR_PPU_SL_Type*) PERI_GR_PPU_SL_LPCOMP_BASE)               /* 0x40300140 */
#define PERI_GR_PPU_SL_CSD                      ((PERI_GR_PPU_SL_Type*) PERI_GR_PPU_SL_CSD_BASE)                  /* 0x40300180 */
#define PERI_GR_PPU_SL_TCPWM0                   ((PERI_GR_PPU_SL_Type*) PERI_GR_PPU_SL_TCPWM0_BASE)               /* 0x40300200 */
#define PERI_GR_PPU_SL_TCPWM1                   ((PERI_GR_PPU_SL_Type*) PERI_GR_PPU_SL_TCPWM1_BASE)               /* 0x40300240 */
#define PERI_GR_PPU_SL_LCD                      ((PERI_GR_PPU_SL_Type*) PERI_GR_PPU_SL_LCD_BASE)                  /* 0x40300280 */
#define PERI_GR_PPU_SL_BLE                      ((PERI_GR_PPU_SL_Type*) PERI_GR_PPU_SL_BLE_BASE)                  /* 0x403002C0 */
#define PERI_GR_PPU_SL_USBFS                    ((PERI_GR_PPU_SL_Type*) PERI_GR_PPU_SL_USBFS_BASE)                /* 0x40300300 */
#define PERI_GR_PPU_SL_PERI_GR4                 ((PERI_GR_PPU_SL_Type*) PERI_GR_PPU_SL_PERI_GR4_BASE)             /* 0x40400000 */
#define PERI_GR_PPU_SL_SMIF                     ((PERI_GR_PPU_SL_Type*) PERI_GR_PPU_SL_SMIF_BASE)                 /* 0x40400080 */
#define PERI_GR_PPU_SL_PERI_GR6                 ((PERI_GR_PPU_SL_Type*) PERI_GR_PPU_SL_PERI_GR6_BASE)             /* 0x40600000 */
#define PERI_GR_PPU_SL_SCB0                     ((PERI_GR_PPU_SL_Type*) PERI_GR_PPU_SL_SCB0_BASE)                 /* 0x40600040 */
#define PERI_GR_PPU_SL_SCB1                     ((PERI_GR_PPU_SL_Type*) PERI_GR_PPU_SL_SCB1_BASE)                 /* 0x40600080 */
#define PERI_GR_PPU_SL_SCB2                     ((PERI_GR_PPU_SL_Type*) PERI_GR_PPU_SL_SCB2_BASE)                 /* 0x406000C0 */
#define PERI_GR_PPU_SL_SCB3                     ((PERI_GR_PPU_SL_Type*) PERI_GR_PPU_SL_SCB3_BASE)                 /* 0x40600100 */
#define PERI_GR_PPU_SL_SCB4                     ((PERI_GR_PPU_SL_Type*) PERI_GR_PPU_SL_SCB4_BASE)                 /* 0x40600140 */
#define PERI_GR_PPU_SL_SCB5                     ((PERI_GR_PPU_SL_Type*) PERI_GR_PPU_SL_SCB5_BASE)                 /* 0x40600180 */
#define PERI_GR_PPU_SL_SCB6                     ((PERI_GR_PPU_SL_Type*) PERI_GR_PPU_SL_SCB6_BASE)                 /* 0x406001C0 */
#define PERI_GR_PPU_SL_SCB7                     ((PERI_GR_PPU_SL_Type*) PERI_GR_PPU_SL_SCB7_BASE)                 /* 0x40600200 */
#define PERI_GR_PPU_SL_SCB8                     ((PERI_GR_PPU_SL_Type*) PERI_GR_PPU_SL_SCB8_BASE)                 /* 0x40600240 */
#define PERI_GR_PPU_SL_PERI_GR9                 ((PERI_GR_PPU_SL_Type*) PERI_GR_PPU_SL_PERI_GR9_BASE)             /* 0x41000000 */
#define PERI_GR_PPU_SL_PASS                     ((PERI_GR_PPU_SL_Type*) PERI_GR_PPU_SL_PASS_BASE)                 /* 0x41000040 */
#define PERI_GR_PPU_SL_PERI_GR10                ((PERI_GR_PPU_SL_Type*) PERI_GR_PPU_SL_PERI_GR10_BASE)            /* 0x42A00000 */
#define PERI_GR_PPU_SL_I2S                      ((PERI_GR_PPU_SL_Type*) PERI_GR_PPU_SL_I2S_BASE)                  /* 0x42A00040 */
#define PERI_GR_PPU_SL_PDM                      ((PERI_GR_PPU_SL_Type*) PERI_GR_PPU_SL_PDM_BASE)                  /* 0x42A00080 */

